tailwind.config = {
    darkMode: "class",
    theme: {
        extend: {
            colors: {
                "primary": "#d32f2f",
                "background-light": "#fde8e8",
                "paper": "#ffffff",
                "line-color": "#e0e0e0",
            },
            fontFamily: {
                "display": ["Space Grotesk", "sans-serif"]
            },
            boxShadow: {
                'card': '0 10px 30px -5px rgba(0, 0, 0, 0.3)',
                'heart': '0 4px 6px rgba(0,0,0,0.1)'
            }
        },
    },
}

const text = `నా హృదయానికి అర్థమైన నీకు 💖💌

నిన్ను చూసినప్పుడల్లా ఈ ప్రపంచం కొంచెం నెమ్మదిగా నడుస్తున్నట్టే అనిపిస్తుంది.🦋💕

నీ పక్కన ఉంటే, మాటలు అవసరం లేవు —
నిశ్శబ్దం కూడా ప్రేమగా మాట్లాడుతుంది.

ఎప్పుడో తెలియకుండా నువ్వు నా రోజుల్లో భాగమయ్యావు,
ఇప్పుడు తెలియకుండానే నా జీవితమయ్యావు. 🗓️✨

నిన్ను ప్రేమిస్తున్నాను అని రోజూ చెప్పను,
కానీ నిన్ను గుర్తు చేసుకోని రోజు ఒక్కటైనా లేదు.😍

నిన్ను కోరుకోవడం ఆశ కాదు,
నిన్ను అర్థం చేసుకోవడమే నా ప్రేమ.❣️

నీ కళ్లలో ఏదో ఉంటుంది…👀
చూస్తే చాలు, మాటలు అవసరం లేవు.
ఆ కళ్లలో నాకు ధైర్యం దొరుకుతుంది,
కొన్నిసార్లు శాంతి,
కొన్నిసార్లు నిశ్శబ్దంగా ఉండమనే ఓ మాట.🤫

 ❤️‍🩹 నిన్ను ప్రేమిస్తున్నాను అని
ఎప్పుడూ పెద్దగా చెప్పలేను,
కానీ నీ కళ్లను చూసిన ప్రతిసారి
నా హృదయం నిజం చెప్పేస్తుంది.🫀

💞 నేను నీకు...
చెప్పిన ప్రతి మాట నిజమే ఎందుకంటే..
అబద్ధం చెప్పి నీకు
దగ్గర కావాలి అని నేనెప్పుడూ అనుకోలేదు...✨🦋

నీ ప్రేమలోనే నిలిచిపోయిన నేను❤️‍🩹❣️`;

const speed = 50;
let i = 0;

function typeWriter() {
    if (i < text.length) {
        document.getElementById("typewriter").innerHTML += text.charAt(i);
        i++;
        // Auto scroll to bottom
        const elem = document.getElementById("typewriter").parentElement.parentElement;
        if (elem) elem.scrollTop = elem.scrollHeight;
        setTimeout(typeWriter, speed);
    }
}

document.addEventListener('DOMContentLoaded', function () {
    const startBtn = document.getElementById('startBtn');
    const textContainer = document.getElementById('textContainer');
    const wrapper = startBtn.parentElement;

    if (startBtn) {
        startBtn.addEventListener('click', function () {
            startBtn.classList.add('hidden');
            textContainer.classList.remove('hidden');

            // Change alignment
            wrapper.classList.remove('items-center', 'justify-center');
            wrapper.classList.add('items-start', 'justify-start');

            typeWriter();
        });
    }
});
